app/controllers/api/steps_controller.rb

  def index
    @steps = Todo.find(params[:todo_id]).steps
---
SELECT "steps".* FROM "steps" WHERE "steps"."todoId" = $1  [["todoId", 2]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @step = Step.new(step_params)
    @step.todoId = params[:todo_id]

    if @step.save
---
INSERT INTO "steps" ("title", "body", "done", "created_at", "updated_at", "todoId") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "grab treats"], ["body", "need for training"], ["done", false], ["created_at", "2021-09-14 18:59:38.560997"], ["updated_at", "2021-09-14 18:59:38.560997"], ["todoId", 2]]

  def update
    @step = Step.find(params[:id])
    if @step
      @step.update(step_params)
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "steps" SET "done" = $1, "updated_at" = $2 WHERE "steps"."id" = $3  [["done", true], ["updated_at", "2021-09-15 18:35:03.878526"], ["id", 1]]

  def destroy
    @step = Step.find(params[:id])
    @step.destroy
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 1]]