app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Todo.find(params[:id]), include: :tags

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_id" = $1  [["todo_id", 11]]
SELECT "todos".* FROM "todos"
---
  def index
    render json: Todo.all, include: :tags

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test todo"], ["body", "does the user_id work?"], ["done", false], ["created_at", "2021-09-20 20:51:32.962866"], ["updated_at", "2021-09-20 20:51:32.962866"], ["user_id", 1]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2021-09-10 19:10:59.366851"], ["id", 2]]
---
  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)