app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 1]]
---
  def index
    render json: Todo.all.where(user_id: current_user.id), include: :tags