app/models/todo.rb

  def tag_names=(tag_names)
    self.tags = tag_names.map do |tag_name|
      Tag.find_or_create_by(name: tag_name)
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdf"], ["created_at", "2021-09-20 20:51:32.914181"], ["updated_at", "2021-09-20 20:51:32.914181"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "asdf"], ["LIMIT", 1]]