app/models/user.rb

  def self.find_by_credentials(user_params)
    user = User.find_by(username: user_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]